cities = [
    "Київ",
    "Львів",
    "Харків",
    "Одеса",
    "Дніпро",
    "Запоріжжя",
    "Івано-Франківськ",
    "Хмельницький",
    "Вінниця",
    "Чернівці",
    "Полтава",
    "Суми",
]


edges = [
    ("Київ", "Львів", {"вага": 8}),
    ("Київ", "Харків", {"вага": 9}),
    ("Львів", "Харків", {"вага": 38}),
    ("Харків", "Одеса", {"вага": 12}),
    ("Одеса", "Дніпро", {"вага": 7}),
    ("Дніпро", "Запоріжжя", {"вага": 1}),
    ("Івано-Франківськ", "Хмельницький", {"вага": 2}),
    ("Хмельницький", "Вінниця", {"вага": 2}),
    ("Вінниця", "Чернівці", {"вага": 14}),
    ("Полтава", "Суми", {"вага": 10}),
    ("Суми", "Київ", {"вага": 16}),
    ("Київ", "Івано-Франківськ", {"вага": 12}),
    ("Івано-Франківськ", "Чернівці", {"вага": 5}),
    ("Чернівці", "Харків", {"вага": 48}),
    ("Хмельницький", "Дніпро", {"вага": 44}),
    ("Одеса", "Львів", {"вага": 21}),
    ("Полтава", "Запоріжжя", {"вага": 8}),
    ("Івано-Франківськ", "Суми", {"вага": 41}),
    ("Вінниця", "Київ", {"вага": 4}),
    ("Чернівці", "Полтава", {"вага": 19}),
]


