import networkx as nx
import matplotlib.pyplot as plt

# Створення направленого графу
G = nx.DiGraph()

# Додавання вершин
cities = ['Київ', 'Львів', 'Харків', 'Одеса', 'Дніпро', 'Запоріжжя', 'Івано-Франківськ', 'Хмельницький', 'Вінниця', 'Чернівці', 'Полтава', 'Суми']
G.add_nodes_from(cities)

edges = [('Київ', 'Львів', {'вага': 8}),
         ('Київ', 'Харків', {'вага': 9}),
         ('Львів', 'Харків', {'вага': 38}),
         ('Харків', 'Одеса', {'вага': 12}),
         ('Одеса', 'Дніпро', {'вага': 7}),
         ('Дніпро', 'Запоріжжя', {'вага': 1}),
         ('Івано-Франківськ', 'Хмельницький', {'вага': 2}),
         ('Хмельницький', 'Вінниця', {'вага': 2}),
         ('Вінниця', 'Чернівці', {'вага': 14}),
         ('Чернівці', 'Полтава', {'вага': 28}),
         ('Полтава', 'Суми', {'вага': 10}),
         ('Суми', 'Київ', {'вага': 16}),
         ('Київ', 'Івано-Франківськ', {'вага': 12}),
         ('Івано-Франківськ', 'Чернівці', {'вага': 5}),
         ('Чернівці', 'Харків', {'вага': 48}),
         ('Хмельницький', 'Дніпро', {'вага': 44}),
         ('Одеса', 'Львів', {'вага': 21}),
         ('Полтава', 'Запоріжжя', {'вага': 8}),
         ('Івано-Франківськ', 'Суми', {'вага': 41}),
         ('Вінниця', 'Київ', {'вага': 4}),
         ('Чернівці', 'Полтава', {'вага': 19})]

G.add_edges_from(edges)


# Візуалізація графу
pos = nx.circular_layout(G)
nx.draw(G, pos, with_labels=True, node_size=700, node_color='skyblue', font_size=8, font_color='black', font_weight='bold', edge_color='gray', width=1.5, font_family='Arial')

# Додаткові атрибути ребер (ваги)
edge_labels = nx.get_edge_attributes(G, 'вага')
nx.draw_networkx_edge_labels(G, pos, edge_labels=edge_labels, font_color='red')

# Вивід графу
plt.show()

